In [0]:
import pandas as pd
import numpy as np

In [0]:
df1 = pd.read_csv('./female_mentions_centrality.csv')
df2 = pd.read_csv('./male_mentions_centrality.csv')
df3 = pd.read_csv('./avg_wv_relation.csv')
df4 = pd.read_csv('./avg_wv_relation.csv')

In [0]:
df1.columns = df1.columns.str.lower()

In [0]:
df2.columns = df2.columns.str.lower()

In [0]:
df1.columns = ['movie name', 'cast', 'mentions', 'total centrality', 'count', 'average centrality']

In [0]:
df2.columns = [ 'movie name', 'cast', 'mentions', 'total centrality', 'count', 'average centrality']

In [0]:
df1['name'] = df1['cast'] + "_" + df1['movie name']

In [0]:
df2['name'] = df2['cast'] + "_" + df2['movie name']

In [0]:
df1['name'] = df1['name'].str.lower()

In [0]:
df2['name'] = df2['name'].str.lower()

In [0]:
df1.head()

,movie name,cast,mentions,total centrality,count,average centrality,name
0,Aan Milo Sajna,woman,2.0,222.500000,12.0,18.541667,woman_aan milo sajna
1,Aan Milo Sajna,savitri,11.0,868.166667,131.0,6.627226,savitri_aan milo sajna
2,Aan Milo Sajna,deepali,4.0,0.000000,89.0,0.000000,deepali_aan milo sajna
3,Abhinetri,anjana,9.0,319.000000,79.0,4.037975,anjana_abhinetri
4,Aag Aur Shola,usha,6.0,48.000000,54.0,0.888889,usha_aag aur shola

In [0]:
df2.head()

,movie name,cast,mentions,total centrality,count,average centrality,name
0,Aan Milo Sajna,anil,13.0,9219.200000,131.0,70.375573,anil_aan milo sajna
1,Bachpan,tom,11.0,29.000000,59.0,0.491525,tom_bachpan
2,Bachpan,father,5.0,469.333333,63.0,7.449735,father_bachpan
3,Bachpan,rahim,2.0,0.000000,29.0,0.000000,rahim_bachpan
4,Aag Aur Shola,nagesh,4.0,94.000000,38.0,2.473684,nagesh_aag aur shola

In [0]:
df3 = df3.iloc[:, 0:3]
df3.columns = ['name', 'gender', 'character']
df3 = df3.dropna()
df3['name'] = df3['name'].str.lower()
df3.head()

                   name   gender               character
6        father_bachpan     MALE              unhappilly
7         rahim_bachpan     MALE  father, father, father
8         kashi_bachpan  UNKNOWN                innocent
11  actor_bombay talkie     MALE                  famous
12         seema_chetna   FEMALE          unrecognizable

In [0]:
df4 = df4.iloc[:, 0:3]
df4.columns = ['name', 'gender', 'character']
df4 = df3.dropna()
df4['name'] = df4['name'].str.lower()
df4.head()

                   name   gender               character
6        father_bachpan     MALE              unhappilly
7         rahim_bachpan     MALE  father, father, father
8         kashi_bachpan  UNKNOWN                innocent
11  actor_bombay talkie     MALE                  famous
12         seema_chetna   FEMALE          unrecognizable

In [0]:
result1 = pd.merge(df3, df1[['movie name', 'mentions', 'count', 'total centrality','average centrality', 'name']], on='name', how='right')
result1.head()

,name,gender,character,movie name,mentions,count,total centrality,average centrality
0,seema_chetna,FEMALE,unrecognizable,Chetna,23.0,170.0,227.500000,1.338235
1,janki_geet,FEMALE,"sister, sister, sister",Geet,7.0,56.0,220.166667,3.931548
2,deepa_jeevan mrityu,FEMALE,"mother, mother, mother",Jeevan Mrityu,5.0,53.0,27.000000,0.509434
3,poonam_kati patang,FEMALE,real,Kati Patang,21.0,177.0,685.699553,3.874009
4,radha_khilona,FEMALE,young,Khilona,11.0,78.0,118.500000,1.519231

In [0]:
result2 = pd.merge(df4, df2[['movie name', 'mentions', 'count', 'total centrality','average centrality', 'name']], on='name', how='right')
result2.head()

,name,gender,character,movie name,mentions,count,total centrality,average centrality
0,father_bachpan,MALE,unhappilly,Bachpan,5.0,63.0,469.333333,7.449735
1,rahim_bachpan,MALE,"father, father, father",Bachpan,2.0,29.0,0.000000,0.000000
2,actor_bombay talkie,MALE,famous,Bombay Talkie,1.0,4.0,15.000000,3.750000
3,man_chetna,MALE,"shy, young",Chetna,1.0,25.0,368.166667,14.726667
4,anil_chetna,MALE,"father, father, father",Chetna,18.0,180.0,526.000000,2.922222

In [0]:
df5 = pd.concat([result1, result2])

In [0]:
df5.head()

,name,gender,character,movie name,mentions,count,total centrality,average centrality
0,seema_chetna,FEMALE,unrecognizable,Chetna,23.0,170.0,227.500000,1.338235
1,janki_geet,FEMALE,"sister, sister, sister",Geet,7.0,56.0,220.166667,3.931548
2,deepa_jeevan mrityu,FEMALE,"mother, mother, mother",Jeevan Mrityu,5.0,53.0,27.000000,0.509434
3,poonam_kati patang,FEMALE,real,Kati Patang,21.0,177.0,685.699553,3.874009
4,radha_khilona,FEMALE,young,Khilona,11.0,78.0,118.500000,1.519231

In [0]:
df5.tail()

,name,gender,character,movie name,mentions,count,total centrality,average centrality
9350,vikramaditya_jumbo,NaN,NaN,Jumbo,11.0,89.0,288.000000,3.235955
9351,father_jumbo,NaN,NaN,Jumbo,12.0,114.0,517.666667,4.540936
9352,akshay_jumbo,NaN,NaN,Jumbo,2.0,47.0,429.500000,9.138298
9353,bakhtavar_jumbo,NaN,NaN,Jumbo,6.0,47.0,267.666667,5.695035
9354,prince_jumbo,NaN,NaN,Jumbo,5.0,52.0,95.666667,1.839744

In [0]:
df5 = df5.dropna()

In [0]:
df5.info()

<class 'pandas.core.frame.DataFrame'>
Int64Index: 4449 entries, 0 to 2759
Data columns (total 8 columns):
name                  4449 non-null object
gender                4449 non-null object
character             4449 non-null object
movie name            4449 non-null object
mentions              4449 non-null float64
count                 4449 non-null float64
total centrality      4449 non-null float64
average centrality    4449 non-null float64
dtypes: float64(4), object(4)
memory usage: 312.8+ KB

In [0]:
df5.tail()

,name,gender,character,movie name,mentions,count,total centrality,average centrality
2755,man_sarhad paar,MALE,bad,Sarhad Paar,1.0,4.0,21.666667,5.416667
2756,ravi_sarhad paar,MALE,uncle,Sarhad Paar,6.0,53.0,317.233333,5.985535
2757,hari_say salaam india,MALE,son,Say Salaam India,9.0,141.0,116.000000,0.822695
2758,nandu_amar prem,MALE,"father, son, child, son, father, son, child, s...",Amar Prem,42.0,368.0,4585.526190,12.460669
2759,man_amar prem,MALE,widowed,Amar Prem,1.0,17.0,102.000000,6.000000

In [0]:
df5.to_csv(path_or_buf='./processed/third.csv', index=True)